In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import os
import numpy as np
import seaborn as sns
sns.set_theme(style="darkgrid")
from functools import reduce
import requests
import json

In [2]:
mar01 = 'twitterapi/030120.csv'
mar05 = 'twitterapi/030520.csv'
mar10 = 'twitterapi/031020.csv'
mar15 = 'twitterapi/031520.csv'
mar20 = 'twitterapi/032020.csv'
mar25 = 'twitterapi/032520.csv'
apr01 = 'twitterapi/040120.csv'
apr05 = 'twitterapi/040520.csv'
apr10 = 'twitterapi/041020.csv'
apr15 = 'twitterapi/041520.csv'
apr20 = 'twitterapi/042020.csv'
apr25 = 'twitterapi/042520.csv'
may01 = 'twitterapi/050120.csv'
may05 = 'twitterapi/050520.csv'
may10 = 'twitterapi/051020.csv'
may15 = 'twitterapi/051520.csv'
may20 = 'twitterapi/052020.csv'
may25 = 'twitterapi/052520.csv'

In [3]:
twitter_mar_01 = pd.read_csv(mar01)
twitter_mar_05 = pd.read_csv(mar05)
twitter_mar_10 = pd.read_csv(mar10)
twitter_mar_15 = pd.read_csv(mar15)
twitter_mar_20 = pd.read_csv(mar20)
twitter_mar_25 = pd.read_csv(mar25)
twitter_apr_01 = pd.read_csv(apr01)
twitter_apr_05 = pd.read_csv(apr05)
twitter_apr_10 = pd.read_csv(apr10)
twitter_apr_15 = pd.read_csv(apr15)
twitter_apr_20 = pd.read_csv(apr20)
twitter_apr_25 = pd.read_csv(apr25)
twitter_may_01 = pd.read_csv(may01)
twitter_may_05 = pd.read_csv(may05)
twitter_may_10 = pd.read_csv(may10)
twitter_may_15 = pd.read_csv(may15)
twitter_may_20 = pd.read_csv(may20)
twitter_may_25 = pd.read_csv(may25)

/Users/jameswhite/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
# twitter_mar_01.dtypes

In [5]:
march_frames = [twitter_mar_01, twitter_mar_05, twitter_mar_10, twitter_mar_15, twitter_mar_20, twitter_mar_25]

In [6]:
april_frames = [twitter_apr_01, twitter_apr_05, twitter_apr_10, twitter_apr_15, twitter_apr_20, twitter_apr_25]

In [7]:
may_frames = [twitter_may_01, twitter_may_05, twitter_may_10, twitter_may_15, twitter_may_20, twitter_may_25]

In [8]:
march_data = reduce(lambda  left,right: pd.merge(left,right,
                                            how='outer'), march_frames)

In [9]:
april_data = reduce(lambda  left,right: pd.merge(left,right,
                                            how='outer'), april_frames)

In [10]:
may_data = reduce(lambda  left,right: pd.merge(left,right,
                                            how='outer'), may_frames)

In [20]:
march_data = march_data[['id', 'created_at', 'place', 'retweet_count']]
march_data['created_at'] = [x.split('12')[0] for x in march_data['created_at']]

/Users/jameswhite/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [21]:
march_data = march_data[march_data['place'].notna()]

In [22]:
march_data

,id,created_at,place,retweet_count
66,1234090090743451650,Sun Mar 01,"Pennsylvania, USA",0
232,1234090114340487174,Sun Mar 01,"Rovereto, Trentino-Alto Adige",0
485,1234090142169780225,Sun Mar 01,"Hillsdale, NJ",0
605,1234090154408673283,Sun Mar 01,"Annot, France",0
641,1234090163418148864,Sun Mar 01,"Wandsworth, London",0
...,...,...,...,...
231855,1242797462441558017,Wed Mar 25,"Dublin City, Ireland",0
231887,1242797462282293248,Wed Mar 25,"Nairobi, Kenya",0
232046,1242797495408824322,Wed Mar 25,"Kendall, FL",0
232070,1242797490694283269,Wed Mar 25,"Ungaran, Indonesia",0
232118,1242797499791835143,Wed Mar 25,"Bogotá, D.C., Colombia",0

In [38]:
march_data['place'].value_counts()

Manhattan, NY                    27
New Delhi, India                 20
Mumbai, India                    17
Madrid, Spain                    14
İstanbul, Türkiye                13
                                 ..
Elizabethtown-Kitley, Ontario     1
Hsinchu County, Taiwan            1
Naut Aran, Spain                  1
Livorno, Tuscany                  1
San Juan, USA                     1
Name: place, Length: 1327, dtype: int64

In [14]:
april_data = april_data[['id', 'created_at', 'place', 'retweet_count']]
april_data['created_at'] = [x.split('12')[0] for x in april_data['created_at']]

In [15]:
april_data = april_data[april_data['place'].notna()]

In [16]:
april_data

,id,created_at,place,retweet_count
25,1245322458921676801,Wed Apr 01,"Crediton, England",0
46,1245322458149933062,Wed Apr 01,"West Midlands, England",0
155,1245322470808223745,Wed Apr 01,"Tuusula, Suomi",1
305,1245322487421755392,Wed Apr 01,"Nairobi, Kenya",0
362,1245322496162717696,Wed Apr 01,"Vijayawada, India",0
...,...,...,...,...
222299,1254031217491673088,Sat Apr 25,"Lekki, Nigeria",1
222378,1254031221140721664,Sat Apr 25,"Camden Town, London",0
222469,1254031242565242880,Sat Apr 25,"Guelph, Ontario",0
222773,1254031272558694405,Sat Apr 25,"Tallinn, Estonia",1
222888,1254031280980717568,Sat Apr 25,"Santa Ana, CA",0

In [37]:
april_data['place'].value_counts()

New Delhi, India      30
Mumbai, India         27
Manhattan, NY         17
Ikeja, Nigeria        17
Madrid, Spain         16
                      ..
United Kingdom         1
Alveston, England      1
Tulsa, OK              1
Etimesgut, Türkiye     1
Itabashi-ku, Tokyo     1
Name: place, Length: 1536, dtype: int64

In [17]:
may_data = may_data[['id', 'created_at', 'place', 'retweet_count']]
may_data['created_at'] = [x.split('12')[0] for x in may_data['created_at']]

In [18]:
may_data = may_data[may_data['place'].notna()]

In [35]:
may_data

,id,created_at,place,retweet_count
60,1256193425415852032,Fri May 01,"Kensington, London",10
140,1256193436442476547,Fri May 01,"Kantō, Chiba",0
433,1256193469384712192,Fri May 01,"Lakeland Heights, TX",0
466,1256193465077108737,Fri May 01,"Banbury, England",0
764,1256193503115313152,Fri May 01,"Shimla, India",3
...,...,...,...,...
218015,1264903991617617923,Mon May 25,"King's Lynn, England",0
218233,1264904010894413824,Mon May 25,"Dindigul, India",0
218422,1264904037045956609,Mon May 25,"Ilagan, Cagayan Valley",0
218497,1264904044205805569,Mon May 25,Robinson Memorial Methodist Marathi Central Ch...,0
218523,1264904045250121854,Mon May 25,"Rayachoti, India",0

In [36]:
may_data['place'].value_counts()

New Delhi, India                39
Mumbai, India                   25
Toronto, Ontario                20
Florida, USA                    16
Madrid, Spain                   16
                                ..
Ciudad Real, Spain               1
Oissel, France                   1
South Stoke, England             1
Vanderbijlpark, South Africa     1
Palwal, India                    1
Name: place, Length: 1420, dtype: int64